app/Http/Controllers/UsersController.php

update `users` set `avatar` = '/uploads/31-1558667244-微信图片_20181121183734.jpg', `users`.`updated_at` = '2019-05-24 11:07:24' where `id` = 31
---
    public function updateAvatar(UserAvatarUpdateRequest $request, $id)
    {
        dd($request);
        try {
            $this->validator->with($request->all())->passesOrFail(ValidatorInterface::RULE_UPDATE);

//            upload files
            $file = $request->avatar;
            $timestamp = Carbon::now()->timestamp;
            $filepath = '/uploads/'.Auth::user()->id.'-'.$timestamp.'-'.$file->getClientOriginalName();
//            intervention image
            Image::make($file)->resize(200)->save(public_path($filepath));